# Toposolid Simplify Method

Source: https://www.revitapidocs.com/2026/dabded04-9e0a-e675-b90e-8b9b0ae7e479.htm

---

| Toposolid Simplify Method |
| --- |

Simplifies the Toposolid by reducing the number of inner vertices to the given percentage.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Simplify(
	double percentage
)
```

```
Public Sub Simplify (
	percentage As Double
)
```

```
public:
void Simplify(
	double percentage
)
```

```
member Simplify :
        percentage : float -> unit
```

#### Parameters

percentage Double
:   The ratio of the number of inner vertices after simplify to the original number.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The input percentage should be greater than 0 and less than 1\. |
| InvalidOperationException | this operation failed. |

Remarks At low percentages, the inner vertices may not be reduced to the exact percentage to keep a rough semblance of the original shape.
 Call this method again if you want to keep removing inner vertices. See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace